Revit 2027 API
ParameterTypeId.PhyMaterialParamStructuralThermalTreated Property
 "Thermally Treated"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PhyMaterialParamStructuralThermalTreated { get; }
Public Shared ReadOnly Property PhyMaterialParamStructuralThermalTreated As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PhyMaterialParamStructuralThermalTreated {
	ForgeTypeId^ get ();
}
static member PhyMaterialParamStructuralThermalTreated : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace